# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [71]:
import pandas as pd

# Correctly read the CSV with the URL as a string
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"
df = pd.read_csv(url)

# Display the first few rows to ensure it's loaded
print(df.head())

  Customer          ST GENDER             Education Customer Lifetime Value  \
0  RB50392  Washington    NaN                Master                     NaN
1  QZ44356     Arizona      F              Bachelor              697953.59%
2  AI49188      Nevada      F              Bachelor             1288743.17%
3  WW63253  California      M              Bachelor              764586.18%
4  GA49547  Washington      M  High School or Below              536307.65%

    Income  Monthly Premium Auto Number of Open Complaints     Policy Type  \
0      0.0                1000.0                    1/0/00   Personal Auto
1      0.0                  94.0                    1/0/00   Personal Auto
2  48767.0                 108.0                    1/0/00   Personal Auto
3      0.0                 106.0                    1/0/00  Corporate Auto
4  36357.0                  68.0                    1/0/00   Personal Auto

   Vehicle Class  Total Claim Amount
0  Four-Door Car            2.704934
1  Four-Door Car         1131.464935
2   Two-Door Car          566.472247
3            SUV          529.881344
4  Four-Door Car           17.269323

In [72]:
print (df.columns)

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [73]:
df.columns = map(str.lower, df.columns)
df.columns

Index(['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'],
      dtype='object')

In [74]:
df.columns = map(lambda x: x.replace(" ", "_"), df.columns)

df.columns

Index(['customer', 'st', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [75]:
df['gender'] = df['gender'].replace({'Male': 'M', 'female' : 'F', 'Femal' : 'F'})
print(df['gender'].unique())

[nan 'F' 'M']

In [76]:
df['st'].value_counts()

st
Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25
Name: count, dtype: int64

In [77]:
df['st']= df['st'].replace({'Cali':'California', 'AZ' : 'Arizona', 'Wa' : 'Washington'})

In [78]:
df['education']=df['education'].replace({'Bachelors': 'Bachelor'})

In [79]:
# Filter the DataFrame to get all rows where 'Education' is 'Bachelor'
bachelor_rows = df.loc[df['education'] == 'Bachelor']

# Display these rows
print(bachelor_rows)

     customer          st gender education customer_lifetime_value   income  \
1     QZ44356     Arizona      F  Bachelor              697953.59%      0.0
2     AI49188      Nevada      F  Bachelor             1288743.17%  48767.0
3     WW63253  California      M  Bachelor              764586.18%      0.0
5     OC83172      Oregon      F  Bachelor              825629.78%  62902.0
8     DY87989      Oregon      M  Bachelor             2412750.40%  14072.0
...       ...         ...    ...       ...                     ...      ...
1056  PI47776      Oregon      F  Bachelor              253070.51%  89451.0
1061  RY92647  California      F  Bachelor             1050677.17%      0.0
1064  YT69858  Washington      F  Bachelor              544142.01%  85702.0
1065  XD85577  California      M  Bachelor              284226.69%  69417.0
1068  GS98873     Arizona      F  Bachelor              323912.47%  16061.0

      monthly_premium_auto number_of_open_complaints     policy_type  \
1                     94.0                    1/0/00   Personal Auto
2                    108.0                    1/0/00   Personal Auto
3                    106.0                    1/0/00  Corporate Auto
5                     69.0                    1/0/00   Personal Auto
8                     71.0                    1/0/00  Corporate Auto
...                    ...                       ...             ...
1056                  63.0                    1/0/00  Corporate Auto
1061                  92.0                    1/0/00   Personal Auto
1064                  67.0                    1/0/00   Personal Auto
1065                  73.0                    1/1/00   Personal Auto
1068                  88.0                    1/0/00   Personal Auto

      vehicle_class  total_claim_amount
1     Four-Door Car         1131.464935
2      Two-Door Car          566.472247
3               SUV          529.881344
5      Two-Door Car          159.383042
8     Four-Door Car          511.200000
...             ...                 ...
1056  Four-Door Car           61.769564
1061  Four-Door Car          546.524896
1064   Two-Door Car          249.085887
1065  Four-Door Car           30.874869
1068  Four-Door Car          633.600000

[331 rows x 11 columns]

In [80]:

df['customer_lifetime_value'] = df['customer_lifetime_value'].str.rstrip('%').astype(float)


print(df['customer_lifetime_value'].head())

0           NaN
1     697953.59
2    1288743.17
3     764586.18
4     536307.65
Name: customer_lifetime_value, dtype: float64

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [81]:
df['customer_lifetime_value'] = pd.to_numeric (df['customer_lifetime_value'], errors='coerce')
print(df.dtypes)

customer                      object
st                            object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [83]:
# STEP 1:
# Check the percentage of missing values in each column 
# Check the data type in each column 

total_values = len(df)
missing_values = df.isnull().sum()
missing_percentage =(missing_values / total_values) * 100
print (missing_percentage)
print("------------------------------------------------------")
print (df.dtypes)

customer                     73.278443
st                           73.278443
gender                       76.197605
education                    73.278443
customer_lifetime_value      73.353293
income                       73.278443
monthly_premium_auto         73.278443
number_of_open_complaints    73.278443
policy_type                  73.278443
vehicle_class                73.278443
total_claim_amount           73.278443
dtype: float64
------------------------------------------------------
customer                      object
st                            object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [84]:
# STEP 2:
# check for skewers and outliers
# the values should be analyzed considering the skewed interpretation scale. 
# And they will define the approach to clean the data. 
# -0.5 to 0.5	                    Approximately Normal ----> Use mean()
# -1 to -0.5 or 0.5 to 1	        Moderately Skewed	 ----> Prefer median() but mean() can work
# Less than -1 or Greater than 1	Highly Skewed	     ----> Use median()


print(df.select_dtypes(include=['number']).skew())

customer_lifetime_value     2.544175
income                      0.217100
monthly_premium_auto       20.281887
total_claim_amount          1.852800
dtype: float64

In [85]:
#STEP 3:
#calculate the median or mean for the columns with skewed values

median_customer_lifetime_value = df['customer_lifetime_value'].median()
mean_income = df['income'].mean()
median_monthly_premium_auto= df['monthly_premium_auto'].median()
median_total_claim_amount= df['total_claim_amount'].median()

print ("The median of customer lifetime value is:", median_customer_lifetime_value)
print ("The mean of income is:", mean_income)
print ("The median of monthly premiou auto is:", median_monthly_premium_auto)
print ("The median of total claim amount is:", median_total_claim_amount)

The median of customer lifetime value is: 588174.235
The mean of income is: 39295.70121381886
The median of monthly premiou auto is: 83.0
The median of total claim amount is: 354.729129

In [86]:
# STep 4:
# Replace all the skewed values by meadian or mean

for col in df.select_dtypes(include=['number']).columns:
    skewness = df[col].skew()
    
    if skewness > 1 or skewness < -1:  # Highly skewed
        df.fillna({col: df[col].median()}, inplace=True)
        print(f"Column: {col} | Skewness: {skewness:.2f} | Filled with: Median")

    else:  
        df.fillna({col: df[col].mean()}, inplace=True)
        print(f"Column: {col} | Skewness: {skewness:.2f} | Filled with: Mean")

Column: customer_lifetime_value | Skewness: 2.54 | Filled with: Median
Column: income | Skewness: 0.22 | Filled with: Mean
Column: monthly_premium_auto | Skewness: 20.28 | Filled with: Median
Column: total_claim_amount | Skewness: 1.85 | Filled with: Median

In [87]:
# STEP 5: 
# replace missing numeric (normal distribution) with the mean 

for col in df.select_dtypes(include=['number']).columns:
    if df[col].isnull().sum() > 0:  # Only process columns with missing values
        df[col].fillna(df[col].mean(), inplace=True)
        print(f"Column: {col} | Filled with: Mean")

In [88]:
STEP 6: 
# replace  missing categorical values by mode:
for col in df.select_dtypes(include=['object']).columns:
    if df[col].isnull().sum() > 0:
        df[col].fillna(df[col].mode()[0], inplace=True) 
        print(f"Column: {col} | Filled with: Mode")

SyntaxError: invalid syntax (3201981893.py, line 1)

In [ ]:
for col in df.select_dtypes(include=['number']).columns:
    print(f"{col}: {df[col].apply(type).value_counts()}")

customer_lifetime_value: customer_lifetime_value
<class 'float'>    4008
Name: count, dtype: int64
income: income
<class 'float'>    4008
Name: count, dtype: int64
monthly_premium_auto: monthly_premium_auto
<class 'float'>    4008
Name: count, dtype: int64
total_claim_amount: total_claim_amount
<class 'float'>    4008
Name: count, dtype: int64

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [99]:
#STEP 1
# check how many duplicates in df

duplicated_rows = df.duplicated().sum()
print("The number of duplicated rows is:", duplicated_rows)

The number of duplicated rows is: 2936

In [102]:
df[df.duplicated()]

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1072,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
1073,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
1074,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
1075,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
1076,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
4004,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
4005,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
4006,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
4007,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129

In [103]:
df[df.duplicated(keep=False)]

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1071,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
1072,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
1073,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
1074,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
1075,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
4004,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
4005,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
4006,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129
4007,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129

In [105]:
df.drop_duplicates(inplace=True)
df

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,588174.235,0.000000,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.590,0.000000,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.170,48767.000000,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.180,0.000000,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.650,36357.000000,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
1067,VJ51327,California,F,High School or Below,2031499.760,63209.000000,102.0,1/2/00,Personal Auto,SUV,207.320041
1068,GS98873,Arizona,F,Bachelor,323912.470,16061.000000,88.0,1/0/00,Personal Auto,Four-Door Car,633.600000
1069,CW49887,California,F,Master,462680.110,79487.000000,114.0,1/0/00,Special Auto,SUV,547.200000
1070,MY31220,California,F,College,899704.020,54230.000000,112.0,1/0/00,Personal Auto,Two-Door Car,537.600000
1071,NaN,NaN,NaN,NaN,588174.235,39295.701214,83.0,NaN,NaN,NaN,354.729129

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [ ]:
# Your code here

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [ ]:
# Your code here